# Tap various repos
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# General Terminal and dev apps
brew "antigen"
brew "automake"
brew "bison"
brew "gdbm"
brew "openssl@1.1"
brew "readline"
brew "bpytop"
brew "libffi"
brew "gh"
brew "github-keygen"
brew "go"
brew "htop"
brew "imagemagick"
brew "libyaml"
brew "links"
brew "mas"
brew "neovim"
brew "nvm"
brew "openssl@3"
brew "postgresql@12"
brew "pyenv"
brew "ranger"
brew "rbenv"
brew "task"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"

# Install various apps
cask "alfred"
cask "amethyst"
cask "calibre"
cask "cheatsheet"
cask "cyberghost-vpn"
cask "discord"
cask "docker"
cask "dozer"
cask "dropzone"
cask "eloston-chromium"
cask "font-mononoki-nerd-font"
cask "gitkraken"
cask "go2shell"
cask "iterm2"
cask "kitty"
cask "obsidian"
cask "openemu"
cask "postman"
cask "scrivener"
cask "signal"
cask "sourcetree"
cask "spotify"
cask "steermouse"
cask "tor-browser"
cask "visual-studio-code"
cask "vivaldi"
cask "zoom"
